const HGmodule = require('./build/Release/sentenceComparatorModule.node');


var commandlist = ["수고했어", "사용가능한질문", "조용히해", "새로고침",
"화면켜", "화면꺼", "알람꺼", "소리 켜", "소리 줄여",
"버틀러", "사라져", "돌아와", "일기예보알려줘", 
"초미세먼지알려줘", '현관문열어줘', "도어락열어줘",
"청소해", "청소그만해", "티비켜", "티비꺼", "공기청정기켜",
"공기청정기꺼", "스위치꺼", "스위치켜", "에어컨켜",
"에어컨꺼", "핸드폰음악틀어줘", "핸드폰음악꺼", 
"실내온도알려줘", "실내습도알려줘", "실외온도알려줘" ,
"실외습도알려줘", "미세먼지알려줘", "심박수알려줘", 
"걸음수알려줘", "밴드배터리알려줘", "불전부꺼", 
"불전부꺼", "거실불켜", "거실불꺼", "화장실불꺼", 
"화장실불켜", "침실불켜", "침실불꺼", "회의실불꺼", 
"회의실불켜", "정류장알려줘", "거실보여줘", "주방보여줘", 
"침실보여줘", "욕실보여줘", "오늘날씨는", "뉴스보여줘",
"동영상보여줘", "홈으로"];

HGmodule.init(commandlist);
var test = HGmodule.getHighProbabilityValue("함두폰음악켜");

console.log(test[0]);
console.log(test[1]);


